[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
,
-
|
π
…
、
〇
一
丁
七
丄
丅
万
丈
三
上
下
不
与
丐
丑
专
且
丕
世
丗
丘
丙
业
丛
东
丝
丞
丢
两
严
丧
个
丫
中
丰
串
临
丸
丹
为
主
丽
举
乂
乃
久
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乖
乘
乙
乜
九
乞
也
习
乡
书
买
乱
乳
乾
亁
了
予
争
事
二
亍
于
亏
云
互
五
井
亖
亘
亚
些
亟
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亲
亳
亸
人
亿
什
仁
仄
仅
仆
仇
仉
今
介
仍
从
仑
仓
仔
仕
他
仗
付
仙
仝
仞
代
令
以
仨
仪
们
仰
仲
件
价
任
份
仿
企
伉
伊
伍
伎
伏
伐
休
众
优
伙
会
伛
伞
伟
传
伤
伦
伪
伫
伯
估
伲
伴
伶
伸
伺
似
伽
伾
佃
但
位
低
住
佐
佑
体
何
佗
佘
余
佚
佛
作
佞
你
佢
佣
佤
佥
佩
佬
佯
佳
佺
佼
佾
使
侃
侄
來
侈
例
侍
侏
侑
侔
侗
供
依
侠
侣
侥
侧
侨
侩
侪
侬
侮
侯
侵
便
促
俄
俆
俊
俎
俏
俐
俑
俗
俚
俛
保
俞
俟
信
俣
俦
俨
俩
俪
俬
俭
修
俯
俱
俸
俺
俾
倌
倍
倏
倒
倔
倗
倘
候
倚
倜
借
倡
倥
倦
倨
倩
倪
倭
债
值
倾
偃
假
偈
偌
偎
偏
偕
做
停
健
偬
偶
偷
偻
偿
傀
傅
傍
傥
储
催
傲
傻
像
僖
僚
僧
僭
僮
僰
僵
僻
僾
儆
儋
儒
儡
儿
兀
允
元
兄
充
兆
先
光
克
免
兑
兔
兕
兖
党
兜
兢
入
全
兩
八
公
六
兮
兰
共
兲
关
兴
兵
其
具
典
兹
养
兼
兽
冀
内
冇
冈
冉
册
再
冏
冒
冔
冕
冗
写
军
农
冠
冢
冤
冥
冬
冯
冰
冲
决
况
冶
冷
冸
冻
冽
净
凄
准
凇
凉
凋
凌
减
凑
凕
凛
凝
几
凡
凤
凫
凭
凯
凰
凳
凶
凸
凹
出
击
函
凿
刀
刁
刃
分
切
刊
刍
刑
划
列
刘
则
刚
创
初
删
判
刨
利
别
刮
到
制
刷
券
刹
刺
刻
剂
剃
削
前
剎
剐
剑
剔
剖
剜
剡
剥
剧
剩
剪
副
割
剿
劈
劏
劖
劙
劚
力
劝
办
功
加
务
劣
动
助
努
劫
劬
劭
励
劲
劳
劾
势
勃
勇
勉
勋
勍
勒
勖
勘
募
勤
勺
勾
勿
匀
包
匆
匈
匍
匏
匐
匕
化
北
匙
匝
匠
匡
匣
匪
匮
匹
区
医
匾
匿
十
千
卅
升
午
卉
半
卌
华
协
卑
卒
卓
单
卖
南
博
卜
占
卡
卢
卣
卤
卦
卧
卫
卯
印
危
即
却
卵
卷
卸
卺
卿
厂
厄
厅
历
厉
压
厌
厍
厘
厚
厝
原
厢
厥
厦
厨
厩
厮
厶
去
厾
县
参
叆
叇
又
叉
及
友
双
反
发
叔
取
受
变
叙
叛
叟
叠
叡
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叹
叼
叽
吁
吃
各
吆
合
吉
吊
同
名
后
吏
吐
向
吓
吕
吗
君
吝
吞
吟
吠
否
吧
吨
含
听
吭
吮
启
吱
吴
吵
吸
吹
吻
吼
吾
呀
呆
呈
告
呐
呓
呕
呖
呗
员
呛
呜
呢
呤
呦
周
呱
味
呵
呷
呻
呼
命
咀
咄
咆
咈
咋
和
咎
咏
咐
咒
咔
咕
咖
咙
咚
咛
咤
咨
咩
咪
咫
咬
咯
咱
咳
咸
咽
哀
品
哂
哄
哇
哈
哉
响
哎
哏
哐
哑
哒
哗
哙
哝
哞
哟
哥
哦
哨
哩
哪
哭
哮
哲
哺
哼
哽
唆
唇
唉
唎
唏
唐
唔
唠
唢
唤
唧
唬
售
唯
唰
唱
唳
唼
唾
啁
啃
啄
商
啊
啐
啕
啖
啜
啡
啤
啥
啦
啧
啪
啭
啰
啷
啸
啼
啾
喀
喂
喃
善
喇
喉
喊
喋
喏
喑
喘
喚
喜
喝
喟
喧
單
喳
喵
喷
喻
喽
嗅
嗑
嗓
嗔
嗜
嗝
嗟
嗣
嗤
嗽
嘉
嘎
嘏
嘘
嘛
嘤
嘱
嘲
嘴
嘶
嘹
嘻
噔
噙
噤
器
噩
噪
噫
噬
噰
噱
噶
噼
嚎
嚓
嚣
嚷
嚼
囊
囍
囗
囚
四
回
因
团
囤
囫
园
囯
困
围
囵
囷
囹
固
国
图
囿
圃
圄
圆
圈
圌
圞
土
圣
在
圩
圭
圯
地
圳
场
圻
圾
址
坂
坄
均
坊
坍
坎
坏
坐
坑
块
坚
坛
坝
坞
坟
坠
坡
坤
坦
坨
坪
坫
坯
坰
坳
坷
坼
垂
垃
垄
垅
垆
型
垌
垒
垓
垛
垞
垠
垡
垢
垣
垤
垦
垧
垫
垲
垴
垻
埂
埃
埊
埋
城
埏
埔
埘
埙
埜
域
埠
埫
埭
培
基
堂
堆
堑
堕
堞
堡
堤
堪
堰
堵
塌
塍
塑
塔
塘
塞
填
塬
塱
塾
墀
境
墅
墉
墓
墙
墚
增
墟
墨
墩
壁
壈
壑
壠
壤
士
壬
壮
声
壳
壶
壹
壻
处
备
复
夏
夑
夔
夕
外
夙
多
夜
夝
够
夤
大
天
太
夫
夭
央
夯
失
头
夷
夸
夹
夺
奀
奁
奂
奄
奇
奈
奉
奋
奎
奏
契
奔
奕
奖
套
奘
奚
奠
奢
奥
女
奴
奶
奸
她
好
妁
如
妃
妄
妆
妇
妈
妍
妒
妓
妖
妗
妙
妞
妥
妨
妩
妪
妫
妮
妯
妹
妻
妾
姆
姊
始
姐
姑
姒
姓
委
姗
姘
姚
姜
姝
姣
姥
姦
姨
姬
姮
姹
姻
姿
威
娃
娄
娅
娆
娇
娈
娉
娌
娑
娓
娘
娜
娟
娣
娥
娩
娱
娲
娴
娶
娼
婀
婆
婉
婊
婚
婢
婪
婴
婵
婶
婷
婺
婿
媒
媚
媛
媪
媲
媳
媸
媺
嫁
嫂
嫄
嫉
嫌
嫏
嫔
嫖
嫘
嫠
嫡
嫣
嫦
嫩
嬉
嬗
嬛
嬴
孀
子
孑
孓
孔
孕
孖
字
存
孙
孚
孜
孝
孟
季
孤
学
孩
孬
孰
孳
孵
孺
孽
宁
它
宅
宇
守
安
宋
完
宏
宓
宕
宗
官
宙
定
宛
宜
宝
实
宠
审
客
宣
室
宥
宦
宪
宫
宭
宰
害
宴
宵
家
宸
容
宽
宾
宿
寂
寄
寅
密
寇
富
寐
寒
寓
寛
寝
寞
察
寡
寤
寥
寧
寨
寮
寰
寸
对
寺
寻
导
寿
封
射
将
尉
尊
小
少
尒
尔
尖
尘
尙
尚
尝
尤
尧
尨
尪
尬
就
尴
尸
尹
尺
尼
尽
尾
尿
局
屁
层
屃
居
屈
届
屋
屌
屎
屏
屐
屑
展
属
屠
屡
屣
履
屦
屯
山
屸
屹
屺
屼
屿
岁
岂
岌
岐
岑
岔
岖
岗
岘
岙
岚
岛
岧
岩
岫
岬
岭
岱
岳
岵
岷
岸
岿
峄
峋
峒
峙
峡
峣
峤
峥
峦
峨
峪
峭
峰
峻
峿
崂
崆
崇
崎
崑
崒
崔
崖
崙
崚
崛
崤
崦
崧
崩
崪
崭
崮
崷
崽
嵇
嵋
嵌
嵘
嵚
嵩
嵫
嵬
嵯
嶀
嶂
嶒
嶙
嶦
嶷
嶽
巅
巉
巌
巍
巘
川
州
巡
巢
工
左
巧
巨
巩
巫
差
己
已
巳
巴
巷
巽
巾
币
市
布
帅
帆
师
希
帏
帐
帔
帕
帖
帘
帙
帚
帛
帜
帝
帡
带
帧
帨
帬
席
帮
帷
常
帻
帼
帽
幄
幅
幌
幔
幕
幛
幞
幡
幢
幪
幮
干
平
年
并
幸
幺
幻
幼
幽
广
庀
庄
庆
庇
床
庋
序
庐
库
应
底
庖
店
庙
庚
府
庞
废
庠
庥
度
座
庭
庵
庶
康
庸
庾
廉
廊
廑
廓
廖
廛
廪
延
廷
建
廿
开
异
弃
弄
弇
弈
弊
弋
式
弓
引
弗
弘
弛
弟
张
弥
弦
弧
弩
弭
弯
弱
弹
强
弼
归
当
录
彝
彡
形
彤
彦
彩
彪
彫
彬
彭
彰
影
彳
彷
役
彻
彼
往
征
徂
径
待
徇
很
徉
徊
律
徐
徒
徕
得
徘
徙
徜
御
徨
循
徭
微
徯
徳
徵
德
徼
徽
心
必
忆
忉
忌
忍
忏
忐
忑
忒
忖
志
忘
忙
忝
忠
忤
忧
忪
快
忱
念
忻
忽
忾
怀
态
怅
怆
怍
怎
怒
怕
怙
怜
思
怠
怡
急
性
怨
怪
怯
怵
总
怼
恁
恂
恃
恋
恍
恐
恒
恕
恙
恚
恢
恣
恤
恧
恨
恩
恪
恫
恬
恭
息
恰
恳
恵
恶
恸
恹
恺
恻
恼
悃
悄
悉
悌
悍
悒
悔
悖
悟
悠
患
悦
您
悬
悭
悯
悱
悲
悴
悸
悼
情
惆
惇
惊
惑
惕
惘
惚
惜
惟
惠
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
想
惴
惶
惹
惺
愁
愆
愈
愉
愍
意
愓
愕
愚
感
愠
愣
愤
愧
愫
愿
慇
慈
慌
慎
慑
慕
慝
慢
慧
慨
慰
慵
慶
慷
憋
憎
憔
憧
憨
憩
憬
憾
懂
懃
懈
懊
懋
懑
懒
懔
懦
懵
懿
戈
戊
戌
戍
戎
戏
成
我
戒
或
戗
战
戚
戛
戟
戡
戢
截
戬
戮
戰
戳
戴
户
戸
戾
房
所
扁
扆
扇
扈
扉
手
才
扎
扑
扒
打
扔
托
扛
扢
扣
执
扩
扪
扫
扬
扭
扮
扯
扰
扳
扶
批
扼
找
承
技
抄
抉
把
抑
抒
抓
抔
投
抖
抗
折
抚
抛
抟
抠
抡
抢
护
报
抨
披
抬
抱
抵
抹
抺
抻
押
抽
抿
拂
拄
担
拆
拇
拈
拉
拌
拍
拎
拐
拒
拓
拔
拖
拗
拘
拙
拚
招
拜
拟
拢
拣
拥
拦
拧
拨
择
括
拭
拯
拱
拳
拴
拼
拽
拾
拿
持
挂
指
挈
按
挐
挑
挖
挚
挝
挞
挟
挠
挡
挣
挤
挥
挨
挪
挫
振
挲
挹
挺
挼
挽
捂
捃
捅
捆
捉
捊
捋
捍
捎
捏
捐
捕
捞
损
捡
换
捣
捧
捭
据
捱
捶
捷
捺
捻
掀
掂
掇
授
掉
掌
掏
掐
排
掖
掘
掞
掠
探
掣
接
控
推
掩
措
掬
掭
掰
掷
掸
掺
掼
掾
揆
揉
揍
描
提
插
揖
揠
握
揣
揩
揪
揫
揭
援
揺
揽
揾
搀
搁
搂
搅
搏
搓
搔
搛
搜
搞
搢
搦
搬
搭
搴
携
摁
摄
摆
摇
摈
摊
摔
摘
摛
摞
摧
摩
摸
摹
撃
撇
撑
撒
撕
撞
撤
撩
撬
播
撮
撰
撵
撷
撸
撺
撼
擂
擅
操
擎
擒
擘
擞
擢
擦
攀
攒
攘
攝
支
收
攸
改
攻
放
政
故
效
敌
敎
敏
救
敕
敖
教
敛
敝
敞
敢
散
敦
敬
数
敲
整
敷
斁
文
斋
斌
斐
斑
斓
斗
料
斚
斛
斜
斝
斟
斡
斤
斥
斧
斩
斫
断
斯
新
方
於
施
旁
旃
旄
旅
旆
旉
旋
旌
旎
族
旐
旒
旖
旗
无
既
日
旦
旧
旨
早
旬
旭
旰
旱
时
旷
旸
旹
旺
旻
昀
昂
昃
昆
昇
昊
昌
明
昏
易
昔
昕
昙
昛
星
映
春
昧
昨
昩
昭
是
昱
昴
昶
昼
昽
显
晃
晋
晌
晏
晒
晓
晕
晖
晚
晜
晞
晟
晤
晥
晦
晨
普
景
晰
晴
晶
晷
智
晾
暂
暄
暇
暑
暖
暗
暝
暧
暨
暮
暴
暾
曈
曌
曙
曚
曛
曜
曝
曦
曩
曰
曲
曳
更
曵
曷
曹
曼
曾
替
最
會
朅
月
有
朋
服
朓
朔
朕
朗
望
朝
期
朦
木
未
末
本
札
术
朱
朴
朵
机
朽
杀
杂
权
杆
杈
杉
李
杏
材
村
杓
杖
杜
杞
束
杠
条
来
杨
杩
杪
杭
杯
杰
東
杲
杳
杵
杷
杼
松
板
极
构
枇
枉
析
枒
枕
林
枚
果
枝
枞
枢
枣
枥
枩
枪
枫
枭
枯
枰
枳
枵
架
枷
枸
枻
枿
柄
柏
某
柑
染
柔
柘
柚
柜
柝
柠
柢
查
柩
柬
柮
柯
柱
柳
柴
柿
栀
栁
栅
标
栈
栉
栊
栋
栌
栎
栏
树
栖
栗
校
栢
栩
株
样
核
根
格
栽
栾
桀
桂
桃
桅
案
桌
桐
桑
桓
桔
桠
桡
桢
档
桥
桦
桧
桨
桩
桶
桷
梁
梅
梆
梓
梗
梢
梦
梧
梨
梭
梯
械
梳
梵
梼
检
棂
棃
棉
棋
棍
棒
棕
棗
棘
棚
棠
棣
棨
棫
森
棱
棵
棹
棺
椁
椅
椋
植
椎
椒
椠
椰
椽
椿
楂
楙
楚
楝
楞
楠
楣
楦
楩
楫
楮
楷
楸
楹
楼
概
榄
榆
榇
榔
榕
榛
榜
榭
榱
榴
榻
榾
槁
槃
槊
槌
槎
槐
槑
槙
槚
槛
槟
槽
樊
樗
樟
模
樨
横
樯
樱
樵
樽
樾
橄
橐
橘
橙
橫
橱
橹
橼
檀
檄
檐
檗
檞
檩
檬
欓
欠
次
欢
欣
欤
欧
欲
欸
欺
款
歃
歆
歇
歉
歌
歙
止
正
此
步
武
歧
歩
歪
歹
死
歼
殁
殃
殄
殆
殇
殉
殊
残
殒
殖
殚
殛
段
殷
殿
毁
毂
毅
毋
母
每
毒
毓
比
毕
毗
毙
毛
毡
毫
毯
毳
毽
氃
氅
氋
氏
民
氓
气
氛
氢
氤
氧
氨
氯
氰
氲
水
氷
永
氿
汀
汁
求
汇
汈
汉
汊
汐
汕
汗
汛
汝
江
池
污
汤
汨
汩
汪
汲
汴
汶
汹
汽
汾
沁
沂
沃
沅
沈
沉
沌
沏
沐
沓
沔
沙
沚
沛
沟
没
沣
沤
沥
沦
沧
沩
沪
沫
沬
沭
沮
沱
沲
河
沸
油
治
沼
沽
沾
沿
泄
泅
泉
泊
泌
泐
泓
法
泗
泚
泛
泞
泠
泡
波
泣
泥
注
泪
泫
泮
泯
泰
泱
泳
泵
泷
泸
泻
泼
泽
泾
洁
洄
洇
洋
洎
洑
洒
洗
洙
洛
洞
津
洪
洱
洲
洵
洹
活
洼
洽
派
流
浃
浅
浆
浇
浉
浊
测
济
浏
浐
浑
浒
浓
浔
浙
浚
浠
浣
浥
浦
浩
浪
浮
浴
海
浸
涂
涅
消
涉
涌
涎
涑
涓
涔
涕
涘
涛
涝
涞
涟
涡
涣
涤
润
涧
涨
涩
涪
涮
涯
液
涴
涵
涸
涿
淀
淄
淅
淆
淇
淋
淌
淏
淑
淖
淘
淙
淝
淞
淡
淤
淫
淬
淮
淯
深
淳
混
淸
淹
添
淼
清
渊
渌
渍
渎
渐
渔
渖
渗
渚
渝
渟
渠
渡
渣
渤
渥
温
渭
港
渰
渲
渴
游
渺
湃
湄
湍
湓
湔
湖
湘
湛
湫
湮
湲
湾
湿
溃
溅
溆
溇
溉
溏
源
溜
溟
溢
溥
溪
溯
溱
溶
溷
溺
滁
滂
滆
滇
滋
滏
滑
滓
滔
滕
滚
滞
滟
满
滢
滤
滥
滦
滨
滩
滴
滹
漂
漆
漈
漉
漏
漓
演
漕
漙
漠
漢
漩
漪
漫
漱
漳
漷
漾
潆
潇
潋
潍
潏
潖
潘
潜
潞
潢
潦
潭
潮
潴
潸
潺
潼
澄
澈
澌
澍
澎
澜
澡
澥
澧
澳
澴
激
濂
濉
濑
濒
濙
濛
濠
濡
濩
濬
濮
濯
瀑
瀚
瀛
瀵
瀸
瀹
灌
灞
火
灭
灯
灰
灵
灶
灸
灺
灼
灾
灿
炀
炁
炅
炉
炊
炎
炒
炕
炖
炙
炜
炫
炬
炭
炮
炯
炳
炷
炸
点
炼
炽
烁
烂
烈
烊
烘
烙
烛
烜
烝
烟
烤
烦
烧
烨
烫
烬
热
烯
烹
烽
焉
焊
焐
焕
焙
焚
焜
焦
焯
焰
焱
然
煅
煊
煌
煎
煜
煞
煤
煦
照
煨
煮
煲
煽
熄
熊
熏
熔
熙
熛
熟
熠
熨
熬
熳
熹
燃
燎
燔
燕
燥
燧
燮
燹
爆
爨
爪
爬
爰
爱
爵
父
爷
爸
爹
爻
爽
爿
片
版
牌
牍
牒
牓
牖
牗
牙
牛
牝
牟
牡
牢
牧
物
牯
牲
牵
特
牺
犀
犁
犂
犄
犇
犊
犍
犟
犬
犯
状
犹
狂
狄
狈
狎
狐
狗
狙
狞
狠
狡
狩
独
狭
狮
狰
狱
狲
狷
狸
狼
猊
猎
猖
猗
猛
猜
猝
猢
猩
猪
猫
献
猱
猴
猷
猾
猿
獒
獗
獭
玄
率
玉
王
玑
玕
玙
玛
玦
玨
玩
玫
玮
环
现
玲
玳
玷
玺
玻
珀
珂
珉
珊
珍
珑
珞
珠
珥
珩
班
珮
珰
珺
球
琅
理
琉
琊
琐
琚
琛
琢
琤
琥
琦
琨
琪
琬
琮
琰
琲
琳
琴
琵
琶
琼
瑁
瑕
瑙
瑚
瑛
瑜
瑞
瑟
瑧
瑰
瑳
瑶
瑸
瑾
璀
璃
璇
璋
璎
璐
璜
璞
璠
璧
璨
環
瓒
瓜
瓞
瓠
瓢
瓣
瓤
瓦
瓮
瓯
瓴
瓶
瓷
瓻
甄
甍
甎
甓
甘
甚
甜
甞
生
甥
甦
用
甩
甫
甬
甭
田
由
甲
申
电
男
甸
画
畀
畄
畅
畊
界
畎
畏
畔
留
畜
畤
略
畦
番
畲
畴
當
畸
畹
畿
疃
疆
疎
疏
疑
疔
疗
疚
疟
疢
疥
疫
疮
疯
疰
疲
疴
疵
疹
疼
疾
病
症
痈
痌
痍
痒
痕
痘
痛
痞
痢
痣
痨
痫
痰
痴
痼
痿
瘀
瘁
瘊
瘐
瘗
瘝
瘟
瘠
瘣
瘤
瘦
瘪
瘫
瘰
瘳
瘴
瘸
瘼
瘾
瘿
癌
癎
癖
癜
癞
癣
癫
癸
登
白
百
皂
的
皆
皇
皈
皋
皎
皑
皓
皕
皖
皤
皮
皱
皴
皿
盂
盃
盅
盆
盈
益
盍
盎
盏
盐
监
盒
盔
盖
盗
盘
盛
盟
盥
盬
目
盯
盱
盲
直
相
盼
盾
省
眄
眇
眈
眉
眊
看
眎
真
眠
眦
眨
眩
眬
眶
眷
眸
眺
眼
着
睁
睃
睆
睇
睍
睐
睑
睚
睛
睡
睢
督
睥
睦
睨
睬
睹
睽
睿
瞄
瞌
瞎
瞑
瞒
瞟
瞠
瞥
瞧
瞩
瞪
瞬
瞰
瞳
瞻
瞿
矅
矊
矍
矗
矛
矜
矢
矣
知
矩
矫
短
矮
石
矶
矿
砀
码
砂
砌
砍
砑
研
砖
砚
砣
砥
砧
砭
砲
破
砸
砺
砻
砾
础
硅
硏
硐
硒
硕
硖
硙
硝
硬
确
碇
碉
碌
碍
碎
碏
碑
碓
碗
碘
碟
碣
碧
碰
碱
碳
碾
磁
磅
磊
磋
磐
磕
磨
磬
磴
磵
磷
磻
礁
礓
礤
礴
示
礼
礽
社
礿
祀
祁
祈
祉
祊
祐
祓
祖
祗
祚
祛
祜
祝
神
祟
祠
祥
祧
票
祫
祭
祯
祲
祷
祸
祺
祾
禀
禁
禄
禅
禊
禋
福
禔
禧
禭
禳
禹
禺
离
禽
禾
秀
私
秃
秉
秋
秌
种
科
秒
秕
秘
租
秣
秤
秦
秧
秩
秫
秬
秭
积
称
移
秽
秾
稀
程
稍
税
稔
稗
稚
稜
稠
稣
稯
稳
稷
稻
稼
稽
稿
穂
穆
穑
穗
穴
究
穷
穹
空
穼
穿
突
窃
窄
窅
窈
窍
窑
窓
窔
窕
窖
窗
窘
窜
窝
窟
窠
窥
窦
窨
窳
窿
立
竖
站
竞
竟
章
竣
童
竦
竭
端
竹
竺
竽
竿
笃
笄
笆
笈
笋
笏
笑
笔
笙
笛
笞
笠
笥
符
笨
第
笳
笺
笼
笾
筇
等
筋
筌
筏
筐
筑
筒
答
策
筚
筛
筝
筠
筦
筮
筱
筲
筳
筵
筷
筹
签
筿
简
箍
箎
箐
箓
箔
箕
算
管
箦
箧
箨
箩
箪
箫
箬
箭
箱
箴
箸
箾
篁
篆
篇
篌
篓
篙
篝
篡
篦
篮
篱
篷
篼
篾
簇
簌
簟
簧
簪
簸
簿
籀
籁
籍
籝
籥
籧
米
类
籽
粉
粑
粒
粕
粗
粘
粜
粟
粤
粥
粪
粮
粱
粲
粹
粼
粽
精
糅
糊
糍
糕
糖
糜
糟
糠
糯
系
紊
素
索
紧
紫
累
絪
絮
綍
維
繁
繄
繇
纂
纚
纛
纠
红
纣
纤
约
级
纩
纪
纫
纬
纭
纮
纯
纱
纲
纳
纵
纶
纷
纸
纹
纺
纻
纽
纾
线
绀
练
组
绅
细
织
终
绉
绊
绌
绍
绎
经
绑
绒
结
绕
绘
给
绚
绛
络
绝
绞
统
绡
绢
绣
绥
绦
继
绩
绪
绫
续
绮
绯
绰
绳
维
绵
绶
绷
绸
绻
综
绽
绾
绿
缀
缁
缃
缄
缅
缆
缈
缉
缊
缌
缎
缑
缒
缓
缔
缕
编
缘
缙
缚
缜
缝
缟
缠
缡
缢
缣
缤
缥
缨
缩
缪
缫
缭
缰
缱
缴
缶
缸
缺
罂
罄
罅
罈
罍
罐
网
罔
罕
罗
罘
罚
罝
罟
罡
罢
罥
罨
罩
罪
置
署
罴
罹
罽
羁
羅
羊
羌
美
羔
羚
羞
羡
群
羯
羲
羸
羹
羽
羿
翀
翁
翅
翊
翎
翔
翕
翘
翚
翛
翟
翠
翡
翥
翦
翩
翮
翰
翱
翳
翻
翼
耀
老
考
耄
者
耆
耋
而
耍
耐
耒
耕
耗
耘
耙
耜
耦
耨
耳
耶
耸
耻
耽
耿
聂
聃
聆
聊
聋
职
聒
联
聘
聚
聩
聪
聿
肃
肄
肆
肇
肉
肋
肌
肓
肖
肘
肚
肛
肝
肠
股
肢
肤
肥
肩
肪
肮
肯
肱
育
肴
肺
肾
肿
胀
胁
胃
胄
胆
背
胎
胖
胙
胚
胜
胝
胞
胡
胤
胥
胧
胪
胭
胯
胳
胶
胸
胼
能
脂
脆
脉
脊
脍
脏
脐
脑
脔
脖
脚
脩
脯
脰
脱
脸
脽
脾
腆
腊
腋
腌
腐
腑
腔
腕
腚
腥
腩
腮
腰
腴
腹
腻
腼
腾
腿
膀
膂
膊
膏
膑
膘
膛
膜
膝
膳
膺
膻
臀
臂
臆
臊
臞
臣
臧
自
臬
臭
至
致
臻
臼
臾
舀
舂
舄
舅
舆
舌
舍
舐
舒
舔
舛
舜
舞
舟
舩
航
舫
般
舰
舱
舳
舴
舵
舶
舷
舸
船
舻
艄
艅
艇
艋
艎
艘
艮
良
艰
色
艳
艺
艾
艿
节
芄
芊
芍
芎
芒
芗
芙
芜
芝
芟
芡
芥
芦
芪
芬
芭
芮
芯
芰
花
芳
芷
芸
芹
芽
芾
苁
苇
苋
苌
苍
苎
苏
苑
苒
苔
苕
苗
苛
苞
苟
苡
若
苦
英
苹
苿
茁
茂
范
茄
茅
茆
茉
茎
茏
茑
茔
茕
茖
茗
茜
茧
茨
茫
茬
茱
茴
茵
茶
茸
茹
荀
荆
荇
荈
草
荏
荐
荒
荔
荚
荜
荞
荟
荠
荡
荣
荤
荥
荧
荩
荫
荮
药
荷
荻
荼
莅
莆
莉
莎
莓
莘
莞
莠
莨
莩
莪
莫
莱
莲
莳
获
莹
莺
莼
莽
菀
菁
菇
菊
菌
菏
菖
菘
菜
菡
菩
華
菰
菱
菲
菽
萁
萃
萄
萅
萆
萋
萌
萍
萎
萏
萝
萤
营
萦
萧
萨
萬
萱
萸
萼
落
葆
著
葛
葡
董
葩
葫
葬
葭
葱
葳
葵
葸
葺
蒂
蒋
蒌
蒙
蒜
蒨
蒪
蒲
蒸
蒹
蒿
蓂
蓄
蓉
蓊
蓑
蓓
蓕
蓝
蓟
蓠
蓦
蓬
蓼
蔌
蔑
蔓
蔗
蔚
蔡
蔫
蔬
蔷
蔸
蔺
蔻
蔼
蔽
蕃
蕈
蕉
蕊
蕖
蕙
蕤
蕰
蕲
蕴
蕾
薄
薇
薏
薙
薛
薜
薤
薪
薮
薯
薰
薹
藉
藏
藐
藓
藕
藜
藤
藩
藻
藿
蘅
蘑
蘖
蘧
蘩
蘭
蘸
虎
虏
虐
虑
虔
虚
虞
虢
虫
虬
虱
虹
虻
虽
虾
蚀
蚁
蚂
蚊
蚌
蚍
蚓
蚕
蚤
蚨
蚩
蚪
蚯
蚱
蛀
蛄
蛆
蛇
蛊
蛋
蛐
蛙
蛛
蛟
蛤
蛩
蛭
蛮
蛰
蛱
蛳
蛸
蛹
蛾
蜀
蜂
蜃
蜇
蜈
蜉
蜍
蜒
蜓
蜕
蜗
蜘
蜚
蜜
蜡
蜢
蜩
蜮
蜷
蜻
蜿
蝇
蝉
蝌
蝎
蝗
蝙
蝠
蝣
蝴
蝶
蝼
螂
螃
融
螓
螭
螯
螳
螺
螽
蟆
蟊
蟏
蟒
蟠
蟢
蟪
蟲
蟴
蟹
蟾
蠡
蠢
蠲
蠹
血
行
衍
衔
街
衙
衡
衢
衣
补
表
衩
衫
衬
衮
衰
衲
衷
衽
衾
衿
袁
袂
袄
袅
袈
袋
袍
袒
袖
袛
袜
袤
被
袭
袱
袷
袼
裀
裁
裂
装
裒
裔
裕
裘
裙
裟
裤
裨
裱
裳
裴
裸
裹
褂
褊
褐
褒
褚
褛
褡
褥
褪
褰
褴
襄
襜
襟
襦
西
要
覃
覆
见
观
规
觅
视
觇
览
觉
觊
觎
觐
觑
角
觚
觞
解
觤
觥
触
言
詹
誉
誓
諴
謌
警
譬
计
订
讣
认
讥
讧
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讵
讶
讷
许
讹
论
讼
讽
设
访
诀
证
诃
评
识
诈
诉
诊
诌
词
诎
诏
译
诓
诔
试
诗
诘
诙
诚
诛
话
诞
诟
诠
诡
询
诣
诤
该
详
诧
诨
诩
诫
语
误
诰
诱
诲
诳
说
诵
请
诸
诺
读
诽
课
谀
谁
谂
调
谄
谅
谆
谈
谊
谋
谍
谎
谏
谐
谑
谒
谓
谕
谖
谗
谙
谚
谛
谜
谝
谟
谠
谡
谢
谣
谤
谥
谦
谧
谨
谩
谪
谬
谭
谯
谰
谱
谲
谴
谶
谷
豁
豆
豉
豐
豕
豗
豚
象
豢
豪
豫
豰
豳
豸
豹
豺
貂
貅
貉
貌
貔
贝
贞
负
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贳
贴
贵
贶
贷
贸
费
贺
贻
贼
贾
贿
赀
赁
赂
赃
资
赅
赆
赈
赉
赊
赋
赌
赍
赎
赏
赐
赑
赓
赔
赖
赘
赚
赛
赜
赝
赞
赠
赡
赢
赣
赤
赦
赧
赪
赫
赭
走
赴
赵
赶
起
趁
超
越
趋
趟
趣
趱
足
趵
趺
趾
跃
跆
跋
跌
跎
跏
跑
跖
跚
距
跟
跤
跨
跪
跬
路
跳
践
跶
跷
跸
跹
跻
跽
踊
踌
踏
踔
踞
踟
踢
踩
踪
踱
踵
蹁
蹂
蹄
蹇
蹈
蹉
蹊
蹋
蹑
蹒
蹙
蹦
蹩
蹬
蹭
蹰
蹲
蹴
躁
躅
躇
躏
躔
身
躬
躯
躲
躺
輶
车
轧
轨
轩
轪
轫
转
轭
轮
软
轰
轱
轲
轳
轴
轵
轶
轸
轺
轻
轼
载
轾
轿
辀
较
辄
辅
辇
辈
辉
辋
辍
辐
辑
输
辔
辕
辖
辗
辘
辙
辚
辛
辜
辞
辟
辣
辨
辩
辫
辰
辱
边
辽
达
迁
迂
迄
迅
过
迈
迍
迎
运
近
迓
返
还
这
进
远
违
连
迟
迢
迤
迥
迦
迩
迪
迫
迭
述
迳
迷
迸
迹
追
退
送
适
逃
逅
逆
选
逊
逋
逍
透
逐
逑
递
途
逖
逗
通
逛
逝
逞
速
造
逡
逢
連
逦
逮
逵
逶
逸
逻
逼
逾
遁
遂
遄
遇
遍
遏
遐
遑
遒
道
遗
遛
遢
遣
遥
遨
遭
遮
遴
遵
遽
避
邀
邂
邃
邅
邈
邋
邑
邓
邕
邗
邙
邛
邠
邢
那
邦
邪
邮
邯
邱
邵
邸
邹
邺
邻
郁
郅
郇
郊
郎
郏
郑
郕
郝
郡
郢
郦
郧
部
郭
郯
郴
郸
都
鄂
鄃
鄅
鄏
鄙
鄢
鄣
鄯
酉
酊
酋
酌
配
酎
酒
酕
酖
酗
酝
酣
酥
酩
酪
酬
酱
酲
酴
酵
酶
酷
酸
酹
酽
酾
酿
醄
醅
醇
醉
醋
醍
醐
醑
醒
醪
醮
醲
醴
醺
醿
釄
采
釉
释
里
重
野
量
金
釜
釭
鉴
銮
錢
錬
錾
鍪
鎏
鏖
鐘
鑫
针
钉
钊
钓
钖
钗
钛
钜
钝
钞
钟
钡
钢
钣
钤
钥
钦
钧
钩
钮
钰
钱
钴
钵
钹
钻
钿
铁
铃
铄
铅
铉
铎
铐
铓
铗
铙
铜
铝
铠
铡
铢
铧
铭
铮
铲
铳
银
铸
铺
链
铿
销
锁
锄
锅
锈
锉
锋
锌
锐
错
锚
锛
锡
锢
锣
锤
锥
锦
锨
锭
键
锯
锰
锲
锵
锷
锸
锻
锼
镀
镂
镇
镌
镏
镐
镕
镖
镛
镜
镝
镞
镫
镭
镰
镲
镳
镶
长
門
閑
間
閟
閤
閴
闇
闉
關
门
闪
闬
闭
问
闯
闰
闱
闲
闳
间
闷
闸
闹
闺
闻
闼
闽
闾
阀
阁
阅
阆
阉
阊
阋
阎
阐
阑
阒
阓
阔
阕
阖
阗
阙
阛
阜
队
阡
阪
阮
阯
阱
防
阳
阴
阵
阶
阻
阿
陀
陂
附
际
陆
陇
陈
陉
陋
陌
降
限
陔
陕
陛
陟
陡
院
除
陨
险
陪
陲
陵
陶
陷
陽
隅
隆
隈
隋
隍
随
隐
隔
隘
隙
障
隧
隲
隶
隹
隼
隽
难
雀
雁
雄
雅
集
雇
雉
雌
雍
雎
雏
雒
雕
雘
雠
雦
雨
雩
雪
雯
雲
雳
零
雷
雹
電
雾
需
霁
霄
霅
霆
震
霈
霉
霍
霎
霏
霑
霓
霖
霙
霜
霝
霞
霪
霭
霰
露
霸
霹
霾
青
靓
靖
静
非
靠
靡
面
靥
革
靴
靶
鞅
鞋
鞍
鞘
鞠
鞫
鞭
鞮
韈
韦
韧
韩
韫
韬
韭
韮
音
韵
韶
顠
页
顶
顷
项
顺
须
顽
顾
顿
颁
颂
颃
预
颅
领
颇
颈
颉
颊
颍
颏
颐
频
颓
颔
颖
颗
题
颜
额
颠
颢
颤
颦
風
颱
风
飏
飐
飒
飔
飕
飘
飙
飚
飞
食
飧
飨
餂
餐
餔
餗
餮
餸
饔
饕
饥
饧
饩
饪
饫
饬
饭
饮
饯
饰
饱
饲
饴
饵
饶
饷
饺
饼
饿
馁
馅
馆
馈
馊
馋
馍
馐
馒
馔
馕
首
馗
香
馥
馨
駃
騃
騄
马
驭
驮
驯
驰
驱
驳
驴
驶
驷
驸
驹
驻
驼
驽
驾
驿
骀
骁
骂
骄
骅
骆
骇
骈
骊
骋
验
骎
骏
骐
骑
骒
骓
骕
骖
骗
骘
骚
骛
骜
骝
骞
骡
骢
骤
骥
骦
骧
骨
骸
髓
高
髟
髡
髦
髫
髭
髯
髲
髹
髻
鬓
鬛
鬟
鬣
鬯
鬻
鬼
魁
魂
魃
魄
魅
魇
魉
魋
魍
魏
魑
魔
魯
鮀
鯑
鱼
鱿
鲁
鲇
鲈
鲍
鲑
鲛
鲜
鲤
鲨
鲩
鲫
鲰
鲲
鲵
鲸
鳃
鳄
鳅
鳌
鳏
鳖
鳜
鳝
鳞
鳥
鳦
鳯
鴂
鴃
鵩
鵰
鶒
鷃
鷟
鷱
鸂
鸑
鸜
鸟
鸠
鸡
鸢
鸣
鸥
鸦
鸨
鸩
鸪
鸭
鸮
鸯
鸰
鸱
鸲
鸳
鸵
鸶
鸽
鸾
鸿
鹂
鹃
鹄
鹅
鹆
鹇
鹈
鹉
鹊
鹌
鹍
鹏
鹑
鹓
鹕
鹗
鹛
鹜
鹞
鹣
鹤
鹥
鹦
鹧
鹩
鹪
鹫
鹬
鹭
鹰
鹳
鹿
麀
麈
麋
麒
麓
麝
麟
麤
麦
麫
麻
麾
黄
黉
黍
黎
黑
黒
黔
默
黙
黛
黜
黟
黠
黩
黯
黹
黻
黼
鼋
鼎
鼐
鼓
鼖
鼙
鼛
鼠
鼻
鼾
齐
齑
齿
龄
龊
龌
龙
龚
龛
龟
龠
！
，
：
；
？
